ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448JCUI.h
/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum {
    EVT_SRC_SWI_IRQ0             = 0U,
    EVT_SRC_SWI_IRQ1             = 1U,
    EVT_SRC_SWI_IRQ2             = 2U,
    EVT_SRC_SWI_IRQ3             = 3U,
    EVT_SRC_SWI_IRQ4             = 4U,
    EVT_SRC_SWI_IRQ5             = 5U,
    EVT_SRC_SWI_IRQ6             = 6U,
    EVT_SRC_SWI_IRQ7             = 7U,
    EVT_SRC_SWI_IRQ8             = 8U,
    EVT_SRC_SWI_IRQ9             = 9U,
    EVT_SRC_SWI_IRQ10            = 10U,
    EVT_SRC_SWI_IRQ11            = 11U,
    EVT_SRC_SWI_IRQ12            = 12U,
    EVT_SRC_SWI_IRQ13            = 13U,
    EVT_SRC_SWI_IRQ14            = 14U,
    EVT_SRC_SWI_IRQ15            = 15U,
    EVT_SRC_SWI_IRQ16            = 16U,
    EVT_SRC_SWI_IRQ17            = 17U,
    EVT_SRC_SWI_IRQ18            = 18U,
    EVT_SRC_SWI_IRQ19            = 19U,
    EVT_SRC_SWI_IRQ20            = 20U,
    EVT_SRC_SWI_IRQ21            = 21U,
    EVT_SRC_SWI_IRQ22            = 22U,
    EVT_SRC_SWI_IRQ23            = 23U,
    EVT_SRC_SWI_IRQ24            = 24U,
    EVT_SRC_SWI_IRQ25            = 25U,
    EVT_SRC_SWI_IRQ26            = 26U,
    EVT_SRC_SWI_IRQ27            = 27U,
    EVT_SRC_SWI_IRQ28            = 28U,
    EVT_SRC_SWI_IRQ29            = 29U,
    EVT_SRC_SWI_IRQ30            = 30U,
    EVT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    EVT_SRC_PORT_EIRQ0           = 0U,      /* EIRQ0  */
    EVT_SRC_PORT_EIRQ1           = 1U,      /* EIRQ1  */
    EVT_SRC_PORT_EIRQ2           = 2U,      /* EIRQ2  */
    EVT_SRC_PORT_EIRQ3           = 3U,      /* EIRQ3  */
    EVT_SRC_PORT_EIRQ4           = 4U,      /* EIRQ4  */
    EVT_SRC_PORT_EIRQ5           = 5U,      /* EIRQ5  */
    EVT_SRC_PORT_EIRQ6           = 6U,      /* EIRQ6  */
    EVT_SRC_PORT_EIRQ7           = 7U,      /* EIRQ7  */
    EVT_SRC_PORT_EIRQ8           = 8U,      /* EIRQ8  */
    EVT_SRC_PORT_EIRQ9           = 9U,      /* EIRQ9  */
    EVT_SRC_PORT_EIRQ10          = 10U,     /* EIRQ10 */
    EVT_SRC_PORT_EIRQ11          = 11U,     /* EIRQ11 */
    EVT_SRC_PORT_EIRQ12          = 12U,     /* EIRQ12 */
    EVT_SRC_PORT_EIRQ13          = 13U,     /* EIRQ13 */
    EVT_SRC_PORT_EIRQ14          = 14U,     /* EIRQ14 */
    EVT_SRC_PORT_EIRQ15          = 15U,     /* EIRQ15 */
    /*  DMA_1  */
    EVT_SRC_DMA1_TC0             = 33U,     /* DMA_1_TC0  */
    EVT_SRC_DMA1_BTC0            = 34U,     /* DMA_1_BTC0 */
    EVT_SRC_DMA1_TC1             = 35U,     /* DMA_1_TC1  */
    EVT_SRC_DMA1_BTC1            = 36U,     /* DMA_1_BTC1 */
    EVT_SRC_DMA1_TC2             = 37U,     /* DMA_1_TC2  */
    EVT_SRC_DMA1_BTC2            = 38U,     /* DMA_1_BTC2 */
    EVT_SRC_DMA1_TC3             = 39U,     /* DMA_1_TC3  */
    EVT_SRC_DMA1_BTC3            = 40U,     /* DMA_1_BTC3 */
    EVT_SRC_DMA1_TC4             = 41U,     /* DMA_1_TC4  */
    EVT_SRC_DMA1_BTC4            = 42U,     /* DMA_1_BTC4 */
    EVT_SRC_DMA1_TC5             = 43U,     /* DMA_1_TC5  */
    EVT_SRC_DMA1_BTC5            = 44U,     /* DMA_1_BTC5 */
    /*  EFM  */
    EVT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  DCU  */
    EVT_SRC_DCU1                 = 55U,     /* DCU1 */
    EVT_SRC_DCU2                 = 56U,     /* DCU2 */
    EVT_SRC_DCU3                 = 57U,     /* DCU3 */
    EVT_SRC_DCU4                 = 58U,     /* DCU4 */
    /*  DMA2  */
    EVT_SRC_DMA2_TC0             = 65U,     /* DMA_2_TC0  */
    EVT_SRC_DMA2_BTC0            = 66U,     /* DMA_2_BTC0 */
    EVT_SRC_DMA2_TC1             = 67U,     /* DMA_2_TC1  */
    EVT_SRC_DMA2_BTC1            = 68U,     /* DMA_2_BTC1 */
    EVT_SRC_DMA2_TC2             = 69U,     /* DMA_2_TC2  */
    EVT_SRC_DMA2_BTC2            = 70U,     /* DMA_2_BTC2 */
    EVT_SRC_DMA2_TC3             = 71U,     /* DMA_2_TC3  */
    EVT_SRC_DMA2_BTC3            = 72U,     /* DMA_2_BTC3 */
    EVT_SRC_DMA2_TC4             = 73U,     /* DMA_2_TC4  */
    EVT_SRC_DMA2_BTC4            = 74U,     /* DMA_2_BTC4 */
    EVT_SRC_DMA2_TC5             = 75U,     /* DMA_2_TC5  */
    EVT_SRC_DMA2_BTC5            = 76U,     /* DMA_2_BTC5 */
    /*  TIMER0  */
    EVT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    EVT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    EVT_SRC_TMR0_1_OVF_A         = 98U,     /* TMR0_1_OVFA */
    EVT_SRC_TMR0_1_OVF_B         = 99U,     /* TMR0_1_OVFB */
    EVT_SRC_TMR0_2_CMP_A         = 100U,    /* TMR0_2_CMPA */
    EVT_SRC_TMR0_2_CMP_B         = 101U,    /* TMR0_2_CMPB */
    EVT_SRC_TMR0_2_OVF_A         = 102U,    /* TMR0_2_OVFA */
    EVT_SRC_TMR0_2_OVF_B         = 103U,    /* TMR0_2_OVFB */
    /*  RTC  */
    EVT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    EVT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  TIMER6_1  */
    EVT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    EVT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    EVT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    EVT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    EVT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    EVT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    EVT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    EVT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    EVT_SRC_TMR6_1_SCMP_A        = 137U,     /* TMR6_1_SCMA */
    EVT_SRC_TMR6_1_SCMP_B        = 138U,     /* TMR6_1_SCMB */
    /*  TIMERA_1  */
    EVT_SRC_TMRA_1_OVF           = 139U,     /* TMRA_1_OVF */
    EVT_SRC_TMRA_1_UDF           = 140U,     /* TMRA_1_UDF */
    EVT_SRC_TMRA_1_CMP           = 141U,     /* TMRA_1_CMP */
    /*  TIMER6_2  */
    EVT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    EVT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    EVT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    EVT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    EVT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    EVT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    EVT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    EVT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    EVT_SRC_TMR6_2_SCMP_A        = 153U,     /* TMR6_2_SCMA */
    EVT_SRC_TMR6_2_SCMP_B        = 154U,     /* TMR6_2_SCMB */
    /*  TIMERA_2  */
    EVT_SRC_TMRA_2_OVF           = 155U,     /* TMRA_2_OVF */
    EVT_SRC_TMRA_2_UDF           = 156U,     /* TMRA_2_UDF */
    EVT_SRC_TMRA_2_CMP           = 157U,     /* TMRA_2_CMP */
    /*  TIMERA_3  */
    EVT_SRC_TMRA_3_OVF           = 171U,     /* TMRA_3_OVF */
    EVT_SRC_TMRA_3_UDF           = 172U,     /* TMRA_3_UDF */
    EVT_SRC_TMRA_3_CMP           = 173U,     /* TMRA_3_CMP */
    /*  TIMERA_4  */
    EVT_SRC_TMRA_4_OVF           = 187U,     /* TMRA_4_OVF */
    EVT_SRC_TMRA_4_UDF           = 188U,     /* TMRA_4_UDF */
    EVT_SRC_TMRA_4_CMP           = 189U,     /* TMRA_4_CMP */
    /*  TIMER4_1  */
    EVT_SRC_TMR4_1_GCMP_UH       = 192U,     /* TMR4_1_GCMUH */
    EVT_SRC_TMR4_1_GCMP_UL       = 193U,     /* TMR4_1_GCMUL */
    EVT_SRC_TMR4_1_GCMP_VH       = 194U,     /* TMR4_1_GCMVH */
    EVT_SRC_TMR4_1_GCMP_VL       = 195U,     /* TMR4_1_GCMVL */
    EVT_SRC_TMR4_1_GCMP_WH       = 196U,     /* TMR4_1_GCMWH */
    EVT_SRC_TMR4_1_GCMP_WL       = 197U,     /* TMR4_1_GCMWL */
    EVT_SRC_TMR4_1_GCMP_XH       = 198U,     /* TMR4_1_GCMXH */
    EVT_SRC_TMR4_1_GCMP_XL       = 199U,     /* TMR4_1_GCMXL */
    EVT_SRC_TMR4_1_OVF           = 200U,     /* TMR4_1_GOVF  */
    EVT_SRC_TMR4_1_UDF           = 201U,     /* TMR4_1_GUDF  */
    EVT_SRC_TMR4_1_RELOAD_U      = 202U,     /* TMR4_1_GRLU  */
    EVT_SRC_TMR4_1_RELOAD_V      = 203U,     /* TMR4_1_GRLV  */
    EVT_SRC_TMR4_1_RELOAD_W      = 204U,     /* TMR4_1_GRLW  */
    EVT_SRC_TMR4_1_RELOAD_X      = 205U,     /* TMR4_1_GRLX  */
    EVT_SRC_TMR4_1_SCMP0         = 206U,     /* TMR4_1_SCM0  */
    EVT_SRC_TMR4_1_SCMP1         = 207U,     /* TMR4_1_SCM1  */
    EVT_SRC_TMR4_1_SCMP2         = 208U,     /* TMR4_1_SCM2  */
    EVT_SRC_TMR4_1_SCMP3         = 209U,     /* TMR4_1_SCM3  */
    EVT_SRC_TMR4_1_SCMP4         = 210U,     /* TMR4_1_SCM4  */
    EVT_SRC_TMR4_1_SCMP5         = 211U,     /* TMR4_1_SCM5  */
    EVT_SRC_TMR4_1_SCMP6         = 212U,     /* TMR4_1_SCM6  */
    EVT_SRC_TMR4_1_SCMP7         = 213U,     /* TMR4_1_SCM7  */
    /*  TIMER4_2  */
    EVT_SRC_TMR4_2_GCMP_UH       = 224U,     /* TMR4_2_GCMUH */
    EVT_SRC_TMR4_2_GCMP_UL       = 225U,     /* TMR4_2_GCMUL */
    EVT_SRC_TMR4_2_GCMP_VH       = 226U,     /* TMR4_2_GCMVH */
    EVT_SRC_TMR4_2_GCMP_VL       = 227U,     /* TMR4_2_GCMVL */
    EVT_SRC_TMR4_2_GCMP_WH       = 228U,     /* TMR4_2_GCMWH */
    EVT_SRC_TMR4_2_GCMP_WL       = 229U,     /* TMR4_2_GCMWL */
    EVT_SRC_TMR4_2_GCMP_XH       = 230U,     /* TMR4_2_GCMXH */
    EVT_SRC_TMR4_2_GCMP_XL       = 231U,     /* TMR4_2_GCMXL */
    EVT_SRC_TMR4_2_OVF           = 232U,     /* TMR4_2_GOVF  */
    EVT_SRC_TMR4_2_UDF           = 233U,     /* TMR4_2_GUDF  */
    EVT_SRC_TMR4_2_RELOAD_U      = 234U,     /* TMR4_2_GRLU  */
    EVT_SRC_TMR4_2_RELOAD_V      = 235U,     /* TMR4_2_GRLV  */
    EVT_SRC_TMR4_2_RELOAD_W      = 236U,     /* TMR4_2_GRLW  */
    EVT_SRC_TMR4_2_RELOAD_X      = 237U,     /* TMR4_2_GRLX  */
    EVT_SRC_TMR4_2_SCMP0         = 238U,     /* TMR4_2_SCM0  */
    EVT_SRC_TMR4_2_SCMP1         = 239U,     /* TMR4_2_SCM1  */
    EVT_SRC_TMR4_2_SCMP2         = 240U,     /* TMR4_2_SCM2  */
    EVT_SRC_TMR4_2_SCMP3         = 241U,     /* TMR4_2_SCM3  */
    EVT_SRC_TMR4_2_SCMP4         = 242U,     /* TMR4_2_SCM4  */
    EVT_SRC_TMR4_2_SCMP5         = 243U,     /* TMR4_2_SCM5  */
    EVT_SRC_TMR4_2_SCMP6         = 244U,     /* TMR4_2_SCM6  */
    EVT_SRC_TMR4_2_SCMP7         = 245U,     /* TMR4_2_SCM7  */
    /*  TIMER4_3  */
    EVT_SRC_TMR4_3_GCMP_UH       = 256U,     /* TMR4_3_GCMUH */
    EVT_SRC_TMR4_3_GCMP_UL       = 257U,     /* TMR4_3_GCMUL */
    EVT_SRC_TMR4_3_GCMP_VH       = 258U,     /* TMR4_3_GCMVH */
    EVT_SRC_TMR4_3_GCMP_VL       = 259U,     /* TMR4_3_GCMVL */
    EVT_SRC_TMR4_3_GCMP_WH       = 260U,     /* TMR4_3_GCMWH */
    EVT_SRC_TMR4_3_GCMP_WL       = 261U,     /* TMR4_3_GCMWL */
    EVT_SRC_TMR4_3_GCMP_XH       = 262U,     /* TMR4_3_GCMXH */
    EVT_SRC_TMR4_3_GCMP_XL       = 263U,     /* TMR4_3_GCMXL */
    EVT_SRC_TMR4_3_OVF           = 264U,     /* TMR4_3_GOVF  */
    EVT_SRC_TMR4_3_UDF           = 265U,     /* TMR4_3_GUDF  */
    EVT_SRC_TMR4_3_RELOAD_U      = 266U,     /* TMR4_3_GRLU  */
    EVT_SRC_TMR4_3_RELOAD_V      = 267U,     /* TMR4_3_GRLV  */
    EVT_SRC_TMR4_3_RELOAD_W      = 268U,     /* TMR4_3_GRLW  */
    EVT_SRC_TMR4_3_RELOAD_X      = 269U,     /* TMR4_3_GRLX  */
    EVT_SRC_TMR4_3_SCMP0         = 270U,     /* TMR4_3_SCM0  */
    EVT_SRC_TMR4_3_SCMP1         = 271U,     /* TMR4_3_SCM1  */
    EVT_SRC_TMR4_3_SCMP2         = 272U,     /* TMR4_3_SCM2  */
    EVT_SRC_TMR4_3_SCMP3         = 273U,     /* TMR4_3_SCM3  */
    EVT_SRC_TMR4_3_SCMP4         = 274U,     /* TMR4_3_SCM4  */
    EVT_SRC_TMR4_3_SCMP5         = 275U,     /* TMR4_3_SCM5  */
    EVT_SRC_TMR4_3_SCMP6         = 276U,     /* TMR4_3_SCM6  */
    EVT_SRC_TMR4_3_SCMP7         = 277U,     /* TMR4_3_SCM7  */
    /*  I2C1  */
    EVT_SRC_I2C1_RXI             = 288U,     /* I2C_1_RXI */
    EVT_SRC_I2C1_TXI             = 289U,     /* I2C_1_TXI */
    EVT_SRC_I2C1_TEI             = 290U,     /* I2C_1_TEI */
    EVT_SRC_I2C1_EEI             = 291U,     /* I2C_1_EEI */
    /*  I2C2  */
    EVT_SRC_I2C2_RXI             = 292U,     /* I2C_2_RXI */
    EVT_SRC_I2C2_TXI             = 293U,     /* I2C_2_TXI */
    EVT_SRC_I2C2_TEI             = 294U,     /* I2C_2_TEI */
    EVT_SRC_I2C2_EEI             = 295U,     /* I2C_2_EEI */
    /*  CMP  */
    EVT_SRC_CMP1                 = 312U,     /* CMP_1_IRQ */
    EVT_SRC_CMP2                 = 313U,     /* CMP_2_IRQ */
    EVT_SRC_CMP3                 = 314U,     /* CMP_3_IRQ */
    EVT_SRC_CMP4                 = 315U,     /* CMP_4_IRQ */
    /*  USART1  */
    EVT_SRC_USART1_EI            = 321U,     /* USART_1_EI    */
    EVT_SRC_USART1_RI            = 322U,     /* USART_1_RI    */
    EVT_SRC_USART1_TI            = 323U,     /* USART_1_TI    */
    EVT_SRC_USART1_RTO           = 324U,     /* USART_1_RTO   */
    EVT_SRC_USART1_TCI           = 326U,     /* USART_1_TCI   */
    /*  USART2  */
    EVT_SRC_USART2_EI            = 328U,     /* USART_2_EI    */
    EVT_SRC_USART2_RI            = 329U,     /* USART_2_RI    */
    EVT_SRC_USART2_TI            = 330U,     /* USART_2_TI    */
    EVT_SRC_USART2_RTO           = 331U,     /* USART_2_RTO   */
    EVT_SRC_USART2_TCI           = 333U,     /* USART_2_TCI   */
    /*  SPI1  */
    EVT_SRC_SPI1_SPRI            = 334U,     /* SPI_1_SPRI */
    EVT_SRC_SPI1_SPTI            = 335U,     /* SPI_1_SPTI */
    EVT_SRC_SPI1_SPII            = 336U,     /* SPI_1_SPII */
    EVT_SRC_SPI1_SPEI            = 337U,     /* SPI_1_SPEI */
    EVT_SRC_SPI1_SPEND           = 338U,     /* SPI_1_SPEND */
    /*  TIMERA_5  */
    EVT_SRC_TMRA_5_OVF           = 340U,     /* TMRA_5_OVF */
    EVT_SRC_TMRA_5_UDF           = 341U,     /* TMRA_5_UDF */
    EVT_SRC_TMRA_5_CMP           = 342U,     /* TMRA_5_CMP */
    /*  EVENT PORT  */
    EVT_SRC_EVENT_PORT1          = 348U,     /* EVENT_PORT1 */
    EVT_SRC_EVENT_PORT2          = 349U,     /* EVENT_PORT2 */
    EVT_SRC_EVENT_PORT3          = 350U,     /* EVENT_PORT3 */
    EVT_SRC_EVENT_PORT4          = 351U,     /* EVENT_PORT4 */
    /*  USART3  */
    EVT_SRC_USART3_BRKWKPI       = 352U,     /* USART_3_BRKWKPI */
    EVT_SRC_USART3_EI            = 353U,     /* USART_3_EI      */
    EVT_SRC_USART3_RI            = 354U,     /* USART_3_RI      */
    EVT_SRC_USART3_TI            = 355U,     /* USART_3_TI      */
    EVT_SRC_USART3_TCI           = 358U,     /* USART_3_TCI     */
    /*  USART4  */
    EVT_SRC_USART4_EI            = 360U,     /* USART_4_EI    */
    EVT_SRC_USART4_RI            = 361U,     /* USART_4_RI    */
    EVT_SRC_USART4_TI            = 362U,     /* USART_4_TI    */
    EVT_SRC_USART4_RTO           = 363U,     /* USART_4_RTO   */
    EVT_SRC_USART4_TCI           = 365U,     /* USART_4_TCI   */
    /*  SPI2  */
    EVT_SRC_SPI2_SPRI            = 366U,     /* SPI_2_SPRI  */
    EVT_SRC_SPI2_SPTI            = 367U,     /* SPI_2_SPTI  */
    EVT_SRC_SPI2_SPII            = 368U,     /* SPI_2_SPII  */
    EVT_SRC_SPI2_SPEI            = 369U,     /* SPI_2_SPEI  */
    EVT_SRC_SPI2_SPEND           = 370U,     /* SPI_2_SPEND */
    /*  SPI3  */
    EVT_SRC_SPI3_SPRI            = 371U,     /* SPI_3_SPRI  */
    EVT_SRC_SPI3_SPTI            = 372U,     /* SPI_3_SPTI  */
    EVT_SRC_SPI3_SPII            = 373U,     /* SPI_3_SPII  */
    EVT_SRC_SPI3_SPEI            = 374U,     /* SPI_3_SPEI  */
    EVT_SRC_SPI3_SPEND           = 375U,     /* SPI_3_SPEND */
    /*  USART5  */
    EVT_SRC_USART5_EI            = 385U,     /* USART_5_EI  */
    EVT_SRC_USART5_RI            = 386U,     /* USART_5_RI  */
    EVT_SRC_USART5_TI            = 387U,     /* USART_5_TI  */
    EVT_SRC_USART5_RTO           = 388U,     /* USART_5_RTO */
    EVT_SRC_USART5_TCI           = 390U,     /* USART_5_TCI */
    /*  USART6  */
    EVT_SRC_USART6_BRKWKPI       = 391U,     /* USART_6_BRKWKPI */
    EVT_SRC_USART6_EI            = 392U,     /* USART_6_EI      */
    EVT_SRC_USART6_RI            = 393U,     /* USART_6_RI      */
    EVT_SRC_USART6_TI            = 394U,     /* USART_6_TI      */
    EVT_SRC_USART6_TCI           = 396U,     /* USART_6_TCI     */
    /*  AOS  */
    EVT_SRC_AOS_STRG             = 415U,     /* AOS_STRG */
    /*  LVD  */
    EVT_SRC_LVD1                = 465U,     /* LVD1 */
    EVT_SRC_LVD2                = 466U,     /* LVD2 */
    /*  WDT  */
    EVT_SRC_WDT_REFUDF           = 471U,     /* WDT_REFUDF */
    /*  ADC1  */
    EVT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    EVT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    EVT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    EVT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    /*  ADC2  */
    EVT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    EVT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    EVT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    EVT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    /*  ADC3  */
    EVT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    EVT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    EVT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    EVT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /*  TRNG  */
    EVT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    EVT_SRC_MAX                  = 511U,
} en_event_src_t;

