ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448JCUI.h
/*  Bit definition for MCAN_RXF0A register  */
#define MCAN_RXF0A_F0AI                                (0x0000003FUL)

/*  Bit definition for MCAN_RXBC register  */
#define MCAN_RXBC_RBSA_POS                             (2U)
#define MCAN_RXBC_RBSA                                 (0x0000FFFCUL)

/*  Bit definition for MCAN_RXF1C register  */
#define MCAN_RXF1C_F1SA_POS                            (2U)
#define MCAN_RXF1C_F1SA                                (0x0000FFFCUL)
#define MCAN_RXF1C_F1S_POS                             (16U)
#define MCAN_RXF1C_F1S                                 (0x007F0000UL)
#define MCAN_RXF1C_F1WM_POS                            (24U)
#define MCAN_RXF1C_F1WM                                (0x7F000000UL)
#define MCAN_RXF1C_F1OM_POS                            (31U)
#define MCAN_RXF1C_F1OM                                (0x80000000UL)

/*  Bit definition for MCAN_RXF1S register  */
#define MCAN_RXF1S_F1FL_POS                            (0U)
#define MCAN_RXF1S_F1FL                                (0x0000007FUL)
#define MCAN_RXF1S_F1GI_POS                            (8U)
#define MCAN_RXF1S_F1GI                                (0x00003F00UL)
#define MCAN_RXF1S_F1PI_POS                            (16U)
#define MCAN_RXF1S_F1PI                                (0x003F0000UL)
#define MCAN_RXF1S_F1F_POS                             (24U)
#define MCAN_RXF1S_F1F                                 (0x01000000UL)
#define MCAN_RXF1S_RF1L_POS                            (25U)
#define MCAN_RXF1S_RF1L                                (0x02000000UL)
#define MCAN_RXF1S_DMS_POS                             (30U)
#define MCAN_RXF1S_DMS                                 (0xC0000000UL)
#define MCAN_RXF1S_DMS_0                               (0x40000000UL)
#define MCAN_RXF1S_DMS_1                               (0x80000000UL)

/*  Bit definition for MCAN_RXF1A register  */
#define MCAN_RXF1A_F1AI                                (0x0000003FUL)

/*  Bit definition for MCAN_RXESC register  */
#define MCAN_RXESC_F0DS_POS                            (0U)
#define MCAN_RXESC_F0DS                                (0x00000007UL)
#define MCAN_RXESC_F1DS_POS                            (4U)
#define MCAN_RXESC_F1DS                                (0x00000070UL)
#define MCAN_RXESC_RBDS_POS                            (8U)
#define MCAN_RXESC_RBDS                                (0x00000700UL)

/*  Bit definition for MCAN_TXBC register  */
#define MCAN_TXBC_TBSA_POS                             (2U)
#define MCAN_TXBC_TBSA                                 (0x0000FFFCUL)
#define MCAN_TXBC_NDTB_POS                             (16U)
#define MCAN_TXBC_NDTB                                 (0x003F0000UL)
#define MCAN_TXBC_TFQS_POS                             (24U)
#define MCAN_TXBC_TFQS                                 (0x3F000000UL)
#define MCAN_TXBC_TFQM_POS                             (30U)
#define MCAN_TXBC_TFQM                                 (0x40000000UL)

/*  Bit definition for MCAN_TXFQS register  */
#define MCAN_TXFQS_TFFL_POS                            (0U)
#define MCAN_TXFQS_TFFL                                (0x0000003FUL)
#define MCAN_TXFQS_TFGI_POS                            (8U)
#define MCAN_TXFQS_TFGI                                (0x00001F00UL)
#define MCAN_TXFQS_TFQPI_POS                           (16U)
#define MCAN_TXFQS_TFQPI                               (0x001F0000UL)
#define MCAN_TXFQS_TFQF_POS                            (21U)
#define MCAN_TXFQS_TFQF                                (0x00200000UL)

/*  Bit definition for MCAN_TXESC register  */
#define MCAN_TXESC_TBDS                                (0x00000007UL)

/*  Bit definition for MCAN_TXBRP register  */
#define MCAN_TXBRP_TRP0_POS                            (0U)
#define MCAN_TXBRP_TRP0                                (0x00000001UL)
#define MCAN_TXBRP_TRP1_POS                            (1U)
#define MCAN_TXBRP_TRP1                                (0x00000002UL)
#define MCAN_TXBRP_TRP2_POS                            (2U)
#define MCAN_TXBRP_TRP2                                (0x00000004UL)
#define MCAN_TXBRP_TRP3_POS                            (3U)
#define MCAN_TXBRP_TRP3                                (0x00000008UL)
#define MCAN_TXBRP_TRP4_POS                            (4U)
#define MCAN_TXBRP_TRP4                                (0x00000010UL)
#define MCAN_TXBRP_TRP5_POS                            (5U)
#define MCAN_TXBRP_TRP5                                (0x00000020UL)
#define MCAN_TXBRP_TRP6_POS                            (6U)
#define MCAN_TXBRP_TRP6                                (0x00000040UL)
#define MCAN_TXBRP_TRP7_POS                            (7U)
#define MCAN_TXBRP_TRP7                                (0x00000080UL)
#define MCAN_TXBRP_TRP8_POS                            (8U)
#define MCAN_TXBRP_TRP8                                (0x00000100UL)
#define MCAN_TXBRP_TRP9_POS                            (9U)
#define MCAN_TXBRP_TRP9                                (0x00000200UL)
#define MCAN_TXBRP_TRP10_POS                           (10U)
#define MCAN_TXBRP_TRP10                               (0x00000400UL)
#define MCAN_TXBRP_TRP11_POS                           (11U)
#define MCAN_TXBRP_TRP11                               (0x00000800UL)
#define MCAN_TXBRP_TRP12_POS                           (12U)
#define MCAN_TXBRP_TRP12                               (0x00001000UL)
#define MCAN_TXBRP_TRP13_POS                           (13U)
#define MCAN_TXBRP_TRP13                               (0x00002000UL)
#define MCAN_TXBRP_TRP14_POS                           (14U)
#define MCAN_TXBRP_TRP14                               (0x00004000UL)
#define MCAN_TXBRP_TRP15_POS                           (15U)
#define MCAN_TXBRP_TRP15                               (0x00008000UL)
#define MCAN_TXBRP_TRP16_POS                           (16U)
#define MCAN_TXBRP_TRP16                               (0x00010000UL)
#define MCAN_TXBRP_TRP17_POS                           (17U)
#define MCAN_TXBRP_TRP17                               (0x00020000UL)
#define MCAN_TXBRP_TRP18_POS                           (18U)
#define MCAN_TXBRP_TRP18                               (0x00040000UL)
#define MCAN_TXBRP_TRP19_POS                           (19U)
#define MCAN_TXBRP_TRP19                               (0x00080000UL)
#define MCAN_TXBRP_TRP20_POS                           (20U)
#define MCAN_TXBRP_TRP20                               (0x00100000UL)
#define MCAN_TXBRP_TRP21_POS                           (21U)
#define MCAN_TXBRP_TRP21                               (0x00200000UL)
#define MCAN_TXBRP_TRP22_POS                           (22U)
#define MCAN_TXBRP_TRP22                               (0x00400000UL)
#define MCAN_TXBRP_TRP23_POS                           (23U)
#define MCAN_TXBRP_TRP23                               (0x00800000UL)
#define MCAN_TXBRP_TRP24_POS                           (24U)
#define MCAN_TXBRP_TRP24                               (0x01000000UL)
#define MCAN_TXBRP_TRP25_POS                           (25U)
#define MCAN_TXBRP_TRP25                               (0x02000000UL)
#define MCAN_TXBRP_TRP26_POS                           (26U)
#define MCAN_TXBRP_TRP26                               (0x04000000UL)
#define MCAN_TXBRP_TRP27_POS                           (27U)
#define MCAN_TXBRP_TRP27                               (0x08000000UL)
#define MCAN_TXBRP_TRP28_POS                           (28U)
#define MCAN_TXBRP_TRP28                               (0x10000000UL)
#define MCAN_TXBRP_TRP29_POS                           (29U)
#define MCAN_TXBRP_TRP29                               (0x20000000UL)
#define MCAN_TXBRP_TRP30_POS                           (30U)
#define MCAN_TXBRP_TRP30                               (0x40000000UL)
#define MCAN_TXBRP_TRP31_POS                           (31U)
#define MCAN_TXBRP_TRP31                               (0x80000000UL)

/*  Bit definition for MCAN_TXBAR register  */
#define MCAN_TXBAR_AR0_POS                             (0U)
#define MCAN_TXBAR_AR0                                 (0x00000001UL)
#define MCAN_TXBAR_AR1_POS                             (1U)
#define MCAN_TXBAR_AR1                                 (0x00000002UL)
#define MCAN_TXBAR_AR2_POS                             (2U)
#define MCAN_TXBAR_AR2                                 (0x00000004UL)
#define MCAN_TXBAR_AR3_POS                             (3U)
#define MCAN_TXBAR_AR3                                 (0x00000008UL)
#define MCAN_TXBAR_AR4_POS                             (4U)
#define MCAN_TXBAR_AR4                                 (0x00000010UL)
#define MCAN_TXBAR_AR5_POS                             (5U)
#define MCAN_TXBAR_AR5                                 (0x00000020UL)
#define MCAN_TXBAR_AR6_POS                             (6U)
#define MCAN_TXBAR_AR6                                 (0x00000040UL)
#define MCAN_TXBAR_AR7_POS                             (7U)
#define MCAN_TXBAR_AR7                                 (0x00000080UL)
#define MCAN_TXBAR_AR8_POS                             (8U)
#define MCAN_TXBAR_AR8                                 (0x00000100UL)
#define MCAN_TXBAR_AR9_POS                             (9U)
#define MCAN_TXBAR_AR9                                 (0x00000200UL)
#define MCAN_TXBAR_AR10_POS                            (10U)
#define MCAN_TXBAR_AR10                                (0x00000400UL)
#define MCAN_TXBAR_AR11_POS                            (11U)
#define MCAN_TXBAR_AR11                                (0x00000800UL)
#define MCAN_TXBAR_AR12_POS                            (12U)
#define MCAN_TXBAR_AR12                                (0x00001000UL)
#define MCAN_TXBAR_AR13_POS                            (13U)
#define MCAN_TXBAR_AR13                                (0x00002000UL)
#define MCAN_TXBAR_AR14_POS                            (14U)
#define MCAN_TXBAR_AR14                                (0x00004000UL)
#define MCAN_TXBAR_AR15_POS                            (15U)
#define MCAN_TXBAR_AR15                                (0x00008000UL)
#define MCAN_TXBAR_AR16_POS                            (16U)
#define MCAN_TXBAR_AR16                                (0x00010000UL)
#define MCAN_TXBAR_AR17_POS                            (17U)
#define MCAN_TXBAR_AR17                                (0x00020000UL)
#define MCAN_TXBAR_AR18_POS                            (18U)
#define MCAN_TXBAR_AR18                                (0x00040000UL)
#define MCAN_TXBAR_AR19_POS                            (19U)
#define MCAN_TXBAR_AR19                                (0x00080000UL)
#define MCAN_TXBAR_AR20_POS                            (20U)
#define MCAN_TXBAR_AR20                                (0x00100000UL)
#define MCAN_TXBAR_AR21_POS                            (21U)
#define MCAN_TXBAR_AR21                                (0x00200000UL)
#define MCAN_TXBAR_AR22_POS                            (22U)
#define MCAN_TXBAR_AR22                                (0x00400000UL)
#define MCAN_TXBAR_AR23_POS                            (23U)
#define MCAN_TXBAR_AR23                                (0x00800000UL)
#define MCAN_TXBAR_AR24_POS                            (24U)
#define MCAN_TXBAR_AR24                                (0x01000000UL)
#define MCAN_TXBAR_AR25_POS                            (25U)
#define MCAN_TXBAR_AR25                                (0x02000000UL)
#define MCAN_TXBAR_AR26_POS                            (26U)
#define MCAN_TXBAR_AR26                                (0x04000000UL)
#define MCAN_TXBAR_AR27_POS                            (27U)
#define MCAN_TXBAR_AR27                                (0x08000000UL)
#define MCAN_TXBAR_AR28_POS                            (28U)
#define MCAN_TXBAR_AR28                                (0x10000000UL)
#define MCAN_TXBAR_AR29_POS                            (29U)
#define MCAN_TXBAR_AR29                                (0x20000000UL)
#define MCAN_TXBAR_AR30_POS                            (30U)
#define MCAN_TXBAR_AR30                                (0x40000000UL)
#define MCAN_TXBAR_AR31_POS                            (31U)
#define MCAN_TXBAR_AR31                                (0x80000000UL)

